from ideas import *
my_ideas = [{"Название": "Умный холодильник", "Жанр": "Головоломка", "Сложность": "средняя"},
            {"Название": "GTA 6", "Жанр": "В разработке", "Сложность": "Ещё не придумали"},
            {"Название": "Лаборатория", "Жанр": "Рогалик", "Сложность": "Высокая"}]
show_ideas(my_ideas)
if input("Хочешь добавить новую идею?(Да/Нет) ").lower().strip() == "да":
    idea = input("Назови название новой игры: ")
    genre = input("Назови её жанр: ")
    difficulty = input("Какова будет её сложность: ")
    add_idea(my_ideas, idea, genre, difficulty)
    show_ideas(my_ideas)
else:
    print("Пока!")
pass